//
//  ThemeManager.swift
//  Memorize
//
//  Created by Or Israeli on 25/08/2023.
//

import SwiftUI

struct ThemeManager {
	static let halloween = ["👻", "👻", "🕷️", "🕷️", "🎃", "🎃", "💀", "💀",
							"🕸️", "🕸️", "🧙‍♀️", "🧙‍♀️", "🙀", "🙀","👹", "👹",
							"😱", "😱", "🍭", "🍭"
	]
	
	static let vehicles = ["🚜", "🚜", "🚗", "🚗", "🚕", "🚕", "🏎️", "🏎️",
						   "🚓", "🚓", "🚑", "🚑","🚒", "🚒", "🚐", "🚐",
						   "🚚", "🚚", "🏍️", "🏍️", "🚲", "🚲"
	]
	
	static let animals = ["🐶", "🐶", "🐱", "🐱", "🐹", "🐹", "🦊", "🦊",
						  "🐻", "🐻", "🐙", "🐙", "🐢", "🐢", "🦋", "🦋",
						"🦄", "🦄", "🐮", "🐮", "🐷", "🐷", "🦖", "🦖"
	]
}
